
#Область ЗагрузкаИзФайлаПервыйСпособ

&НаКлиенте
Процедура ЗагрузитьИзФайлаПервыйСпособ(Команда)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ФайловыеФункции") Тогда
			МодульФайловыеФункцииСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ФайловыеФункцииСлужебныйКлиент");
			ПутьКФайлу = МодульФайловыеФункцииСлужебныйКлиент.КаталогМоиДокументы();
		Иначе
			ПутьКФайлу = "";
		КонецЕсли;
		
		ПолучитьПутьКФайлуНачалоВыбора(РежимДиалогаВыбораФайла.Открытие, ПутьКФайлу, "");
		ВыбранныйФайл = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлу);		
		Если ЗначениеЗаполнено(ВыбранныйФайл.Имя) Тогда
			
			ИмяФайла = ВыбранныйФайл.ПолноеИмя;
			РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла);
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		
			АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
			
			ЗагрузитьИзФайлаНаСервере(АдресХранилища, РасширениеФайла);
			
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПутьКФайлуНачалоВыбора(РежимДиалога, ПутьКФайлу, ИмяФайла = "")
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Книга Excel 2007 (*.xlsx)|*.xlsx'");
	ДиалогВыбораФайла.Заголовок                   = "Выбор файла Excel для загрузки данных";
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла              = ИмяФайла;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаИзФайлаВторойСпособ

&НаКлиенте
Процедура ЗагрузитьИзФайлаВторойСпособ(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьПослеПомещенияФайла", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	//ПараметрыЗагрузки.Диалог.Фильтр = "Файл данных (*.csv) |*.csv";
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПослеПомещенияФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(ВыбранныеФайлы.Хранение, ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ВыбранныеФайлы.Имя));
			
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресХранилища, РасширениеФайла)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Если РасширениеФайла = "xlsx" Тогда
		
		ЗагрузитьИзФайлаExcel(ИмяВременногоФайла);
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьИзФайлаExcel(ИмяФайлаExcel)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяФайлаExcel, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	Если ТабДок.Области.Найти("Загрузка") <> Неопределено Тогда
		ТабДок = ТабДок.ПолучитьОбласть("Загрузка");
	КонецЕсли;
	
	Если ТабДок.Области.Количество() > 1 И ТабДок.Области.Найти("Загрузка") = Неопределено Тогда
						
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Файл Excel должен содержать один лист или лист ""Загрузка"".'"));
		возврат;
						
	КонецЕсли;
	
	Для НомерСтрокиExcel = 2 По ТабДок.ВысотаТаблицы Цикл
		
		НомерКолонкиExcel = 1;
		ЗначениеЯчейки = ТабДок.Область(НомерСтрокиExcel, НомерКолонкиExcel, НомерСтрокиExcel, НомерКолонкиExcel).Текст;
	
	КонецЦикла;
	
КонецПроцедуры